load_testing/dynamic_balancing_3_servers_double_skews.txt
Started phase 0 (FIRST PHASE), duration: 30s @ 00:31:29(+0000) 2022-05-23
Report @ 00:31:39(+0000) 2022-05-23
Elapsed time: 10 seconds
  Scenarios launched:  12939
  Scenarios completed: 12934
  Requests completed:  12934
  Mean response/sec: 1287.36
  Response time (msec):
    min: 1
    max: 190
    median: 2
    p95: 22
    p99: 60
  Codes:
    200: 12930
    410: 4
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 190
    median: 2
    p95: 22
    p99: 60
  plugins.metrics-by-endpoint./kv-request.codes.200: 12930
  plugins.metrics-by-endpoint./kv-request.codes.410: 4

Report @ 00:31:49(+0000) 2022-05-23
Elapsed time: 20 seconds
  Scenarios launched:  14972
  Scenarios completed: 14973
  Requests completed:  14973
  Mean response/sec: 1512.32
  Response time (msec):
    min: 0
    max: 145
    median: 2
    p95: 13
    p99: 35
  Codes:
    200: 14973
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 0
    max: 145
    median: 2
    p95: 13
    p99: 35
  plugins.metrics-by-endpoint./kv-request.codes.200: 14973

Report @ 00:31:59(+0000) 2022-05-23
Elapsed time: 30 seconds
  Scenarios launched:  15132
  Scenarios completed: 15132
  Requests completed:  15132
  Mean response/sec: 1526.94
  Response time (msec):
    min: 1
    max: 131
    median: 2
    p95: 10
    p99: 19
  Codes:
    200: 15132
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 131
    median: 2
    p95: 10
    p99: 19
  plugins.metrics-by-endpoint./kv-request.codes.200: 15132

Report @ 00:32:09(+0000) 2022-05-23
Elapsed time: 40 seconds
  Scenarios launched:  15022
  Scenarios completed: 15020
  Requests completed:  15020
  Mean response/sec: 1515.84
  Response time (msec):
    min: 1
    max: 156
    median: 2
    p95: 27
    p99: 66
  Codes:
    200: 15020
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 156
    median: 2
    p95: 27
    p99: 66
  plugins.metrics-by-endpoint./kv-request.codes.200: 15020

Started phase 1 (SECOND PHASE), duration: 30s @ 00:32:10(+0000) 2022-05-23
Report @ 00:32:19(+0000) 2022-05-23
Elapsed time: 50 seconds
  Scenarios launched:  15032
  Scenarios completed: 15025
  Requests completed:  15025
  Mean response/sec: 1515.32
  Response time (msec):
    min: 1
    max: 132
    median: 2
    p95: 10
    p99: 21
  Codes:
    200: 15025
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 132
    median: 2
    p95: 10
    p99: 21
  plugins.metrics-by-endpoint./kv-request.codes.200: 15025

Report @ 00:32:29(+0000) 2022-05-23
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  15046
  Scenarios completed: 15049
  Requests completed:  15049
  Mean response/sec: 1519.8
  Response time (msec):
    min: 1
    max: 161
    median: 2
    p95: 10
    p99: 25
  Codes:
    200: 15049
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 161
    median: 2
    p95: 10
    p99: 25
  plugins.metrics-by-endpoint./kv-request.codes.200: 15049

Report @ 00:32:39(+0000) 2022-05-23
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  14977
  Scenarios completed: 14982
  Requests completed:  14982
  Mean response/sec: 1511.3
  Response time (msec):
    min: 1
    max: 137
    median: 2
    p95: 12
    p99: 27.7
  Codes:
    200: 14982
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 137
    median: 2
    p95: 12
    p99: 27.7
  plugins.metrics-by-endpoint./kv-request.codes.200: 14982

Report @ 00:32:49(+0000) 2022-05-23
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  15025
  Scenarios completed: 15026
  Requests completed:  15026
  Mean response/sec: 1514.62
  Response time (msec):
    min: 1
    max: 125
    median: 2
    p95: 12
    p99: 26
  Codes:
    200: 15026
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 125
    median: 2
    p95: 12
    p99: 26
  plugins.metrics-by-endpoint./kv-request.codes.200: 15026

Started phase 2 (THIRD PHASE), duration: 30s @ 00:32:50(+0000) 2022-05-23
Report @ 00:32:59(+0000) 2022-05-23
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  15022
  Scenarios completed: 15022
  Requests completed:  15022
  Mean response/sec: 1512.79
  Response time (msec):
    min: 1
    max: 129
    median: 2
    p95: 9
    p99: 18
  Codes:
    200: 15022
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 129
    median: 2
    p95: 9
    p99: 18
  plugins.metrics-by-endpoint./kv-request.codes.200: 15022

Report @ 00:33:09(+0000) 2022-05-23
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  14647
  Scenarios completed: 14641
  Requests completed:  14641
  Mean response/sec: 1478
  Response time (msec):
    min: 1
    max: 793
    median: 2
    p95: 32
    p99: 598
  Codes:
    200: 14641
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 793
    median: 2
    p95: 32
    p99: 598
  plugins.metrics-by-endpoint./kv-request.codes.200: 14641

Report @ 00:33:19(+0000) 2022-05-23
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  15140
  Scenarios completed: 15147
  Requests completed:  15147
  Mean response/sec: 1503.48
  Response time (msec):
    min: 1
    max: 127
    median: 2
    p95: 10
    p99: 23
  Codes:
    200: 15147
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 127
    median: 2
    p95: 10
    p99: 23
  plugins.metrics-by-endpoint./kv-request.codes.200: 15147

Report @ 00:33:29(+0000) 2022-05-23
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  14956
  Scenarios completed: 14950
  Requests completed:  14950
  Mean response/sec: 1532.38
  Response time (msec):
    min: 1
    max: 297
    median: 2
    p95: 13
    p99: 29
  Codes:
    200: 14950
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 297
    median: 2
    p95: 13
    p99: 29
  plugins.metrics-by-endpoint./kv-request.codes.200: 14950

Report @ 00:33:31(+0000) 2022-05-23
Elapsed time: 2 minutes, 2 seconds
  Scenarios launched:  2090
  Scenarios completed: 2099
  Requests completed:  2099
  Mean response/sec: 1083.42
  Response time (msec):
    min: 1
    max: 133
    median: 2
    p95: 14
    p99: 31
  Codes:
    200: 2099
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 1
    max: 133
    median: 2
    p95: 14
    p99: 31
  plugins.metrics-by-endpoint./kv-request.codes.200: 2099

All virtual users finished
Summary report @ 00:33:32(+0000) 2022-05-23
  Scenarios launched:  180000
  Scenarios completed: 180000
  Requests completed:  180000
  Mean response/sec: 1464.13
  Response time (msec):
    min: 0
    max: 793
    median: 2
    p95: 14
    p99: 38
  Scenario counts:
    Front end 2: 89902 (49.946%)
    Front end 1: 90098 (50.054%)
  Codes:
    200: 179996
    410: 4
  plugins.metrics-by-endpoint.response_time./kv-request:
    min: 0
    max: 793
    median: 2
    p95: 14
    p99: 38
  plugins.metrics-by-endpoint./kv-request.codes.200: 179996
  plugins.metrics-by-endpoint./kv-request.codes.410: 4

2022-05-23 00:31:27.548 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-05-23 00:31:32.549 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.1233343662844746 
2022-05-23 00:31:37.554 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.1530163236337825 
2022-05-23 00:31:42.552 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1748424225815293 
2022-05-23 00:31:47.555 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1765091004321069 
2022-05-23 00:31:52.555 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.174070594551067 
2022-05-23 00:31:57.558 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1815806662312216 
2022-05-23 00:32:02.563 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1881749460043196 
2022-05-23 00:32:07.564 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1594145569620253 
2022-05-23 00:32:12.565 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.14555002019658 
2022-05-23 00:32:17.567 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1262879788639366 
2022-05-23 00:32:22.569 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1615498056039684 
2022-05-23 00:32:27.574 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.148776637726914 
2022-05-23 00:32:32.576 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1434176701393588 
2022-05-23 00:32:37.576 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1419098143236073 
2022-05-23 00:32:42.578 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1412824304341982 
2022-05-23 00:32:47.580 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1224219989423585 
2022-05-23 00:32:52.591 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.257165926524021 
2022-05-23 00:32:57.588 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.135546875 
2022-05-23 00:33:02.588 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1125171939477303 
2022-05-23 00:33:07.596 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1478433974784341 
2022-05-23 00:33:12.593 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1168545504536707 
2022-05-23 00:33:17.597 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1647058823529413 
2022-05-23 00:33:22.602 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1473122691834223 
2022-05-23 00:33:27.602 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.154669132215031 
2022-05-23 00:33:32.601 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.154632587859425 
2022-05-23 00:33:37.603 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN